src/main/resources/pushClaim.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
   <soap:Header>
      <wsse:Security soap:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
         <wsse:UsernameToken wsu:Id="UsernameToken-1">
            <wsse:Username>cxf</wsse:Username>
            <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">password</wsse:Password>
         </wsse:UsernameToken>
      </wsse:Security>
   </soap:Header>
   <soap:Body>
      <ns2:pushClaim xmlns:ns2="http://inbound.template.interfaces.cccis.com/">
         <arg0><![CDATA[<claim xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="vehicleClaimRequestTmp">
<accHistories>
<accidentNo>=accidentNo=</accidentNo>
<caseStatus>处理中</caseStatus>
<claimNo>=claimNo=</claimNo>
<commercialPaidAmount>2000000.00</commercialPaidAmount>
<compulsoryPaidAmount>3000000.00</compulsoryPaidAmount>
<compulsoryPolicyNo>SHEN201311120001</compulsoryPolicyNo>
<coverageCode>10</coverageCode>
<coverageName>第三者责任险</coverageName>
<damageDate>2017-09-31T03:00:00.560+08:00</damageDate>
<damageSummary>操作失误，碰擦</damageSummary>
<dutyType>02</dutyType>
<lossVehicleType>=lossVehicleType=</lossVehicleType>
<plateNo>沪A12345</plateNo>
<vin>=vin=</vin>
<totalEstimateAmount>100000000.00</totalEstimateAmount>
</accHistories>
<accLossInfo>
<accidentNo>=accidentNo=</accidentNo>
<accidentProcessDept>05</accidentProcessDept>
<accidentProcessMode>02</accidentProcessMode>
<bodyInjuryFlag>1</bodyInjuryFlag>
<damageCourse>操作失误，碰擦</damageCourse>
<damageDate>2017-09-31T03:00:00.560+08:00</damageDate>
<damageReason>21</damageReason>
<damageSite>沂蒙路113号</damageSite>
<dutyCertType>01</dutyCertType>
<dutyType>02</dutyType>
<dutyTypeRatio>70.00</dutyTypeRatio>
<reportDate>2017-09-31T17:32:33.561+08:00</reportDate>
<surveyMode>01</surveyMode>
</accLossInfo>
<accPolicies>
<accPolicyCoverages>
<coverageCode>0101</coverageCode>
<coverageName>机动车交通事故责任强制保险</coverageName>
<deductibleAmount>0.00</deductibleAmount>
<deductibleRate>0</deductibleRate>
<endDate>2018-03-31T17:32:33.560+08:00</endDate>
<insuredLiability>110000.00</insuredLiability>
<planPremium>950.00</planPremium>
<rate>10</rate>
<startDate>2017-01-01T17:32:33.560+08:00</startDate>
<withoutDeductible>无</withoutDeductible>
</accPolicyCoverages>
<accPolicyDrivers>
<driverCardNo>371312198401010078</driverCardNo>
<driverCardType>01</driverCardType>
<driverLicenseNo>371312198401010078</driverLicenseNo>
<driverName>夏秋</driverName>
</accPolicyDrivers>
<accPolicyDrivers>
<driverCardNo>371324196306110093</driverCardNo>
<driverCardType>01</driverCardType>
<driverLicenseNo>371324196306110093</driverLicenseNo>
<driverName>夏春</driverName>
</accPolicyDrivers>
<accPolicyEndorses>
<changeAmount>100000.00</changeAmount>
<changePremium>100000.00</changePremium>
<coverageCode>10</coverageCode>
<endorseDate>2017-05-21T17:32:33.560+08:00</endorseDate>
<endorseEndDate>2018-03-21T17:32:33.560+08:00</endorseEndDate>
<endorseNo>PDH8888001</endorseNo>
<endorseStartDate>2017-05-21T17:32:33.560+08:00</endorseStartDate>
<endorseText>从无车牌改为鲁QA3001</endorseText>
<endorseType>修改车牌号</endorseType>
<remark>赛车事件，导致2人当场死亡，3人送至医院</remark>
</accPolicyEndorses>
<appliAddress>临沂市北园路50号</appliAddress>
<appliBusinessSort>股份公司</appliBusinessSort>
<appliCardNo>320654895621589875</appliCardNo>
<appliCardType>01</appliCardType>
<appliEmail>kobe@sina.com</appliEmail>
<appliFixedTelNo>02188888888</appliFixedTelNo>
<appliName>001</appliName>
<appliTelNo>88888888888</appliTelNo>
<appliType>创始人</appliType>
<appliZipCode>226661</appliZipCode>
<carownerAddress>临沂市北园路50号</carownerAddress>
<carownerBirthday>2017-05-21T17:32:33.560+08:00</carownerBirthday>
<carownerBusinessSort>BusinessS</carownerBusinessSort>
<carownerCardNo>371312198703090122</carownerCardNo>
<carownerCardType>01</carownerCardType>
<carownerEmail>carOwnerEmail@qq.com</carownerEmail>
<carownerFixedTelNo>2234212</carownerFixedTelNo>
<carownerGender>男</carownerGender>
<carownerInsuredSameFlag>1</carownerInsuredSameFlag>
<carownerName>李念儿</carownerName>
<carownerTelNo>456789012</carownerTelNo>
<carownerType>01</carownerType>
<carownerZipCode>226661</carownerZipCode>
<circCommercialConfirmSeqNo>businessConfirmSeqNo</circCommercialConfirmSeqNo>
<circCommercialSeqNo>businessSeqNo</circCommercialSeqNo>
<circPolicyConfirmSeqNo>投保确认码</circPolicyConfirmSeqNo>
<circTransactionNo>platTransactionNo</circTransactionNo>
<circVehicleModelQueryNo>modelQueryNo</circVehicleModelQueryNo>
<insuredAddress>临沂市北园路50号</insuredAddress>
<insuredAge>26</insuredAge>
<insuredAmount>100</insuredAmount>
<insuredBusinessSort>NBA</insuredBusinessSort>
<insuredCardNo>371312198401010078</insuredCardNo>
<insuredCardType>01</insuredCardType>
<insuredCareer>职业篮球员</insuredCareer>
<insuredEmail>qiaodan@sina.com</insuredEmail>
<insuredFixedTelNo>16236544896</insuredFixedTelNo>
<insuredGender>男</insuredGender>
<insuredName>夏秋</insuredName>
<insuredTelNo>13526597859</insuredTelNo>
<insuredType>球员</insuredType>
<insuredZipCode>226661</insuredZipCode>
<notFullAmountInsFlag>1</notFullAmountInsFlag>
<notFullAmountInsRate>10</notFullAmountInsRate>
<policyBusinessSource>业务来源</policyBusinessSource>
<policyCompanyName>CIC</policyCompanyName>
<policyEndDate>2017-08-20T03:00:47.431+08:00</policyEndDate>
<policyIssuingDate>2017-05-21T17:32:33.560+08:00</policyIssuingDate>
<policyNo>Policy20161207001</policyNo>
<policyProposalDate>2017-05-21T17:32:33.560+08:00</policyProposalDate>
<policyProposalNo>TBDH8888001</policyProposalNo>
<policySalesChannel>人工</policySalesChannel>
<policySalesMan>霍华德</policySalesMan>
<policySpecialAgreement></policySpecialAgreement>
<policyStartDate>2017-05-07T17:32:33.560+08:00</policyStartDate>
<policyType>01</policyType>
<vehicleAddDeviceFlag>1</vehicleAddDeviceFlag>
<vehicleBodyColor>黑色</vehicleBodyColor>
<vehicleBrandName>01</vehicleBrandName>
<vehicleCarKindCode>01</vehicleCarKindCode>
<vehicleEngineCapacity>10</vehicleEngineCapacity>
<vehicleEngineNo>FDJH001</vehicleEngineNo>
<vehicleFirstRegisterDate>2017-05-21T17:32:33.560+08:00</vehicleFirstRegisterDate>
<vehicleImportFlag>1</vehicleImportFlag>
<vehicleInvoiceDate>2017-05-21T17:32:33.560+08:00</vehicleInvoiceDate>
<vehicleKiloCount>10</vehicleKiloCount>
<vehicleLicenseCarKind>lisCarKind</vehicleLicenseCarKind>
<vehicleLicenseModel>licenseModel</vehicleLicenseModel>
<vehicleMileages>1000</vehicleMileages>
<vehicleOwner>owner</vehicleOwner>
<vehiclePlateColor>01</vehiclePlateColor>
<vehiclePlateNo>沪A12345</vehiclePlateNo>
<vehiclePlateType>01</vehiclePlateType>
<vehiclePoWeight>10</vehiclePoWeight>
<vehiclePurchasePrice>18.8</vehiclePurchasePrice>
<vehicleRunArea>车道</vehicleRunArea>
<vehicleSeatCount>10</vehicleSeatCount>
<vehicleSubModel>卡罗拉 2008款 1.8L GL-S 自动 运动版</vehicleSubModel>
<vehicleSubModelCode>subModelCode</vehicleSubModelCode>
<vehicleTrafficModelType>trafficMod</vehicleTrafficModelType>
<vehicleTrafficQueryNo>trafficQueryNo</vehicleTrafficQueryNo>
<vehicleTransferRegisterDate>2017-05-21T17:32:33.560+08:00</vehicleTransferRegisterDate>
<vehicleUseNatureCode>01</vehicleUseNatureCode>
<vehicleVin>VF7N0RFN18AF58465</vehicleVin>
<vehicleViolationRecord>发生10次车祸</vehicleViolationRecord>
</accPolicies>
<accPolicies>
<accPolicyCoverages>
<coverageCode>01</coverageCode>
<coverageName>机动车损失保险</coverageName>
<deductibleAmount>0.00</deductibleAmount>
<deductibleRate>0</deductibleRate>
<endDate>2017-08-20T03:00:00.561+08:00</endDate>
<insuredLiability>2000000.00</insuredLiability>
<planPremium>12000.00</planPremium>
<rate>10</rate>
<startDate>2017-05-21T17:32:33.561+08:00</startDate>
<withoutDeductible>无</withoutDeductible>
</accPolicyCoverages>
<accPolicyDrivers>
<driverCardNo>371312198401010078</driverCardNo>
<driverCardType>01</driverCardType>
<driverLicenseNo>371312198401010078</driverLicenseNo>
<driverName>夏秋</driverName>
</accPolicyDrivers>
<accPolicyDrivers>
<driverCardNo>371324196306110093</driverCardNo>
<driverCardType>01</driverCardType>
<driverLicenseNo>371324196306110093</driverLicenseNo>
<driverName>夏春</driverName>
</accPolicyDrivers>
<accPolicyEndorses>
<changeAmount>100000.00</changeAmount>
<changePremium>100000.00</changePremium>
<coverageCode>10</coverageCode>
<endorseDate>2017-05-21T17:32:33.561+08:00</endorseDate>
<endorseEndDate>2017-05-21T17:32:33.561+08:00</endorseEndDate>
<endorseNo>PDH8888001</endorseNo>
<endorseStartDate>2017-05-21T17:32:33.561+08:00</endorseStartDate>
<endorseText>从无车牌改为鲁QA3001</endorseText>
<endorseType>修改车牌号</endorseType>
<remark>赛车事件，导致2人当场死亡，3人送至医院</remark>
</accPolicyEndorses>
<appliAddress>上海市徐汇区龙漕路28号</appliAddress>
<appliBusinessSort>股份公司</appliBusinessSort>
<appliCardNo>320654895621589875</appliCardNo>
<appliCardType>01</appliCardType>
<appliEmail>kobe@sina.com</appliEmail>
<appliFixedTelNo>02188888888</appliFixedTelNo>
<appliName>001</appliName>
<appliTelNo>88888888888</appliTelNo>
<appliType>创始人</appliType>
<appliZipCode>226661</appliZipCode>
<carownerAddress>临沂市北园路50号</carownerAddress>
<carownerBirthday>2017-05-21T17:32:33.561+08:00</carownerBirthday>
<carownerBusinessSort>BusinessS</carownerBusinessSort>
<carownerCardNo>371312198703090122</carownerCardNo>
<carownerCardType>01</carownerCardType>
<carownerEmail>carOwnerEmail@qq.com</carownerEmail>
<carownerFixedTelNo>2234212</carownerFixedTelNo>
<carownerGender>男</carownerGender>
<carownerInsuredSameFlag>1</carownerInsuredSameFlag>
<carownerName>李念儿</carownerName>
<carownerTelNo>456789012</carownerTelNo>
<carownerType>carOwnerT</carownerType>
<carownerZipCode>226661</carownerZipCode>
<circCommercialConfirmSeqNo>businessConfirmSeqNo</circCommercialConfirmSeqNo>
<circCommercialSeqNo>businessSeqNo</circCommercialSeqNo>
<circPolicyConfirmSeqNo>投保确认码</circPolicyConfirmSeqNo>
<circTransactionNo>platTransactionNo</circTransactionNo>
<circVehicleModelQueryNo>modelQueryNo</circVehicleModelQueryNo>
<insuredAddress>临沂市北园路50号</insuredAddress>
<insuredAge>26</insuredAge>
<insuredAmount>100</insuredAmount>
<insuredBusinessSort>NBA</insuredBusinessSort>
<insuredCardNo>371312198401010078</insuredCardNo>
<insuredCardType>01</insuredCardType>
<insuredCareer>职业篮球员</insuredCareer>
<insuredEmail>qiaodan@sina.com</insuredEmail>
<insuredFixedTelNo>16236544896</insuredFixedTelNo>
<insuredGender>男</insuredGender>
<insuredName>夏秋</insuredName>
<insuredTelNo>13526597859</insuredTelNo>
<insuredType>球员</insuredType>
<insuredZipCode>226661</insuredZipCode>
<notFullAmountInsFlag>1</notFullAmountInsFlag>
<notFullAmountInsRate>10</notFullAmountInsRate>
<policyBusinessSource>业务来源</policyBusinessSource>
<policyCompanyName>CIC</policyCompanyName>
<policyEndDate>2017-08-20T03:00:00.561+08:00</policyEndDate>
<policyIssuingDate>2017-05-21T17:32:33.561+08:00</policyIssuingDate>
<policyNo>Policy20161207001</policyNo>
<policyProposalDate>2017-05-21T17:32:33.561+08:00</policyProposalDate>
<policyProposalNo>TBDH8888001</policyProposalNo>
<policySalesChannel>人工</policySalesChannel>
<policySalesMan>霍华德</policySalesMan>
<policySpecialAgreement></policySpecialAgreement>
<policyStartDate>2017-05-07T17:32:33.561+08:00</policyStartDate>
<policyType>02</policyType>
<vehicleAddDeviceFlag>1</vehicleAddDeviceFlag>
<vehicleBodyColor>黑色</vehicleBodyColor>
<vehicleBrandName>01</vehicleBrandName>
<vehicleCarKindCode>01</vehicleCarKindCode>
<vehicleEngineCapacity>10</vehicleEngineCapacity>
<vehicleEngineNo>FDJH001</vehicleEngineNo>
<vehicleFirstRegisterDate>2017-05-21T17:32:33.561+08:00</vehicleFirstRegisterDate>
<vehicleImportFlag>1</vehicleImportFlag>
<vehicleInvoiceDate>2017-05-21T17:32:33.561+08:00</vehicleInvoiceDate>
<vehicleKiloCount>10</vehicleKiloCount>
<vehicleLicenseCarKind>lisCarKind</vehicleLicenseCarKind>
<vehicleLicenseModel>licenseModel</vehicleLicenseModel>
<vehicleMileages>1000</vehicleMileages>
<vehicleOwner>owner</vehicleOwner>
<vehiclePlateColor>01</vehiclePlateColor>
<vehiclePlateNo>沪A12345</vehiclePlateNo>
<vehiclePlateType>01</vehiclePlateType>
<vehiclePoWeight>10</vehiclePoWeight>
<vehiclePurchasePrice>18.8</vehiclePurchasePrice>
<vehicleRunArea>车道</vehicleRunArea>
<vehicleSeatCount>10</vehicleSeatCount>
<vehicleSubModel>嘉年华 两厢 2009款 1.3L 手动 经典版</vehicleSubModel>
<vehicleSubModelCode>subModelCode</vehicleSubModelCode>
<vehicleTrafficModelType>trafficMod</vehicleTrafficModelType>
<vehicleTrafficQueryNo>trafficQueryNo</vehicleTrafficQueryNo>
<vehicleTransferRegisterDate>2017-05-21T17:32:33.561+08:00</vehicleTransferRegisterDate>
<vehicleUseNatureCode>01</vehicleUseNatureCode>
<vehicleVin>VF7N0RFN18AF58465</vehicleVin>
<vehicleViolationRecord>发生10次车祸</vehicleViolationRecord>
</accPolicies>
<accident>
<acceptor>奥拉朱旺</acceptor>
<accidentCourse>操作失误，碰擦</accidentCourse>
<accidentNo>=accidentNo=</accidentNo>
<accidentProcessDept>05</accidentProcessDept>
<accidentProcessMode>02</accidentProcessMode>
<accidentReason>21</accidentReason>
<accidentSection>01</accidentSection>
<agent>报案代理人</agent>
<bodyInjuryFlag>0</bodyInjuryFlag>
<businessNature>业务来源</businessNature>
<claimCompanyName>案件处理机构</claimCompanyName>
<compulsorySelfPayFlag>1</compulsorySelfPayFlag>
<contactMobileNo>155555555555</contactMobileNo>
<contactName>ContactName</contactName>
<contactTelNo>155555555555</contactTelNo>
<damageArea>01</damageArea>
<damageDate>2017-09-31T03:00:00.560+08:00</damageDate>
<damageReason>21</damageReason>
<damageSite>沂蒙路113号</damageSite>
<damageSiteType>14</damageSiteType>
<estimateSite>沂蒙路113号</estimateSite>
<greatCaseFlag>1</greatCaseFlag>
<insuredMobileNo>155555555555</insuredMobileNo>
<insuredName>顾子言</insuredName>
<insuredPhoneNo>18644557899</insuredPhoneNo>
<policyCompanyName>CIC</policyCompanyName>
<relToInsured>04</relToInsured>
<reportDate>2018-01-01T09:20:47.431+08:00</reportDate>
<reportFirstPlaceFlag>1</reportFirstPlaceFlag>
<reportLossAmount>10000.00</reportLossAmount>
<reportNo>BA0001</reportNo>
<reporter>阚小美</reporter>
<reporterFixedTelNo>12345678</reporterFixedTelNo>
<reporterTelNo>18611227899</reporterTelNo>
<selfClaimFlag>0</selfClaimFlag>
<surveyMode>01</surveyMode>
<surveyType>01</surveyType>
<weather>阴</weather>
</accident>
    <claimInfo>
        <accidentNo>=accidentNo=</accidentNo>
        <bigCaseFlag>0</bigCaseFlag>
        <claimCompanyId>=claimCompanyId=</claimCompanyId>
        <claimNo>=claimNo=</claimNo>
        <claimSource>1</claimSource>
        <entrustFlag>0</entrustFlag>
        <entrustLimitAmount>100</entrustLimitAmount>
        <estimateCompanyId>=claimCompanyId=</estimateCompanyId>
        <commercialPolicyNo>Policy20161207002</commercialPolicyNo>
        <operableCompanyId>=claimCompanyId=</operableCompanyId>
        <quickCompensateFlag>1</quickCompensateFlag>
        <reportNo>BA0001</reportNo>
        <taskType>01</taskType>
        <tenementId>0</tenementId>
        <compulsoryPolicyNo>Policy20161207001</compulsoryPolicyNo>
        <transferNo>0</transferNo>
        <validFlag>1</validFlag>
    </claimInfo>
    <claimStatus>01</claimStatus>
    <needValidation>0</needValidation>
    <surveyInfo>
        <accidentType>01</accidentType>
        <surveyType>01</surveyType>
    </surveyInfo>
    <survey>
        <accidentNo>=accidentNo=</accidentNo>
        <assignDate>2017-05-04T09:20:47.431+08:00</assignDate>
        <attachmentSystem>01</attachmentSystem>
        <claimCompanyId>=claimCompanyId=</claimCompanyId>
        <commercialPolicyNo>Policy20161207002</commercialPolicyNo>
        <firstAssignDate>2017-05-04T09:20:47.431+08:00</firstAssignDate>
        <insuredLevel>01</insuredLevel>
        <insuredName>冷文卿</insuredName>
        <reportDate>2017-09-31T17:22:23.543+08:00</reportDate>
        <reportNo>acc_20170917_01</reportNo>
        <surveyCompanyId>=claimCompanyId=</surveyCompanyId>
        <surveySource>1</surveySource>
        <compulsoryPolicyNo>Policy20161207001</compulsoryPolicyNo>
        <validFlag>1</validFlag>
    </survey>
    <userAccount>=estimator=</userAccount>
    <vehicleBaseInfo>
        <lossVehicleType>=lossVehicleType=</lossVehicleType>
        <plateNo>沪A12345</plateNo>
    </vehicleBaseInfo>
    <claimVehicleLossInfos>
        <collisionPoint>1M</collisionPoint>
        <mainCollisionPointFlag>1</mainCollisionPointFlag>
    </claimVehicleLossInfos>
    <claimVehicleLossInfos>
        <collisionPoint>3R</collisionPoint>
        <mainCollisionPointFlag>0</mainCollisionPointFlag>
    </claimVehicleLossInfos>
    <vehicleBaseInfo>
        <brandModel>FV7184</brandModel>
        <currentValue>50</currentValue>
        <engineNo>1111</engineNo>
        <licenseFirstRegisterDate>2017-05-21T09:20:47.431+08:00</licenseFirstRegisterDate>
        <lossVehicleType>=lossVehicleType=</lossVehicleType>
        <plateColorId>01</plateColorId>
        <plateNo>沪A12345</plateNo>
        <plateType>01</plateType>	
        <purchasePrice>18.8</purchasePrice>
        <usingType>01</usingType>
        <vehicleBodyColorId>01</vehicleBodyColorId>
        <vehicleCategory>01</vehicleCategory>
        <vin>=vin=</vin>
    </vehicleBaseInfo>
 <vehicleDefineInfo>

    </vehicleDefineInfo>
</claim>]]></arg0>
      </ns2:pushClaim>
   </soap:Body>
</soap:Envelope>